HRMREDChuklinTest.ZUPC/src/DataProcessors/ZUPC_МассовоеСозданиеЧатовExpress/ZUPC_МассовоеСозданиеЧатовExpress.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ZUPC_МассовоеСозданиеЧатовExpress</name>
</mdclass:DataProcessor>

HRMREDChuklinTest.ZUPC/src/InformationRegisters/ТекущиеКадровыеДанныеСотрудников/ТекущиеКадровыеДанныеСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="55f96922-028d-4a96-a3c9-653b994a0706">
  <name>ТекущиеКадровыеДанныеСотрудников</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="3d3bd907-82d8-4053-af99-ccc82cd0db7e">
    <name>КоличествоСтавок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>22</precision>
          <scale>20</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="90e09cae-c7a4-4f25-84de-c27440b64872">
    <name>ДатаУвольнения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="9ff86afd-b8eb-441b-80f8-caf217d5d8c0">
    <name>ТекущееПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="b9d20b2d-2b8b-47e4-a638-1e8193d73498">
    <name>ОсновноеРабочееМестоВОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="95c957a3-253d-40b3-b048-0d4b596c7f6d">
    <name>ТекущаяДолжность</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="b44fe2e8-7e7d-49f3-8093-d1168b8ea6bf">
    <name>УдалитьТекущаяДолжностьПоШтатномуРасписанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="86ad1530-e436-4c70-83a1-4a65b12d4227">
    <name>ДатаПриема</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="5ad687b9-d72d-492f-8689-63d3125ff1e1">
    <name>ТекущийВидЗанятости</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="8b162a19-847f-4ae7-8b7f-44ff03d9d607">
    <name>УдалитьТекущийВидДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="116fa0c3-d229-4c7d-bbc2-b7eace52fa41">
    <name>ОформленПоТрудовомуДоговору</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="6e2ac4ce-cd62-461a-bb51-f527a812727b">
    <name>УдалитьТекущаяТерритория</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="cb0c087a-f25c-4015-b8c9-6e6e97c5f537">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="78e252f8-2002-4f46-9ad8-b27563ee317b">
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b89e1f07-1182-491c-aeaf-e07889652d10">
    <name>ГоловнаяОрганизация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="67f3d1be-ad78-436f-9290-377da8f2287c">
    <name>ТекущаяОрганизация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

HRMREDChuklinTest.ZUPC/src/InformationRegisters/ZUPC_НовыеCотрудники/ZUPC_НовыеCотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ZUPC_НовыеCотрудники</name>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>ДатаВыхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ActualDepartmentName</name>
    <type>
      <types>CatalogRef.ZUPC_ActualDepartmentName</types>
    </type>
  </resources>
  <resources>
    <name>ActualPositionTitle</name>
    <type>
      <types>CatalogRef.ZUPC_ActualPositionTitle</types>
    </type>
  </resources>
  <resources>
    <name>Desk_Team</name>
    <type>
      <types>CatalogRef.ZUPC_Desk_Team</types>
    </type>
  </resources>
  <resources>
    <name>ДолжностьСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>ОкладNet</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗарплатаТекущая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ОкладИзОффера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>450</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГодовойБонусИзОффера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Юр_Лицо</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ДоходАгенства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Агенство</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Офис</name>
    <type>
      <types>CatalogRef.ZUPC_Офисы</types>
    </type>
  </resources>
  <resources>
    <name>НомерМеста</name>
    <type>
      <types>CatalogRef.ZUPC_НомерМеста</types>
    </type>
  </resources>
  <resources>
    <name>ОрганизоватьРабочееМесто</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СоздатьАккаунт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Пропуск</name>
    <type>
      <types>CatalogRef.ZUPC_Пропуски</types>
    </type>
  </resources>
  <resources>
    <name>МобильныйТелефон</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КомментарийДляИТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеСогл</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Перевод</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Увольнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтменаВыхода</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдаленнаяРабота</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Город</name>
    <type>
      <types>CatalogRef.ZUPC_Locations</types>
    </type>
  </resources>
  <resources>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтменаУвольнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Спеллинг</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>FirstName</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>LastName</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>UserLogonName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РучнойВводИмени</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АгентскаяОрганизация</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>DateJoingGroup</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗарплатаПослеИспСрока</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗарплатаЧерез6Мес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗарплатаЧерезГод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗарплатаЧерез9Мес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ZUPC_RemoteWorkLocation</name>
    <type>
      <types>CatalogRef.ZUPC_RemoteWorkLocation</types>
    </type>
  </resources>
  <resources>
    <name>Декрет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПовторныйНайм</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>SearchSource</name>
    <type>
      <types>EnumRef.ZUPC_SearchSource</types>
    </type>
  </resources>
  <resources>
    <name>Referree</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>AgencyName</name>
    <type>
      <types>CatalogRef.ZUPC_Agency</types>
    </type>
  </resources>
  <resources>
    <name>AgentFee</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СозданОбработкойНачальногоЗаполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>СотрудникСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>201</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

HRMREDChuklinTest.ZUPC/src/DataProcessors/ZUPC_МассовоеСозданиеЧатовExpress/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ЧатШаблон.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Чаты"); 
	Элементы.СотрудникиЧаты.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Чаты");
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗаполнитьСотрудников(Команда)
	ЗаполнитьСотрудниковНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьEmail(Команда)
	ПолучитьEmailНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьHuid(Команда)
	ЗаполнитьHuidНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЧаты(Команда)
	Если Не ЗначениеЗаполнено(ЧатШаблон) Тогда
		Сообщить("Выберите чат-шаблон.");
		Возврат;
	КонецЕсли;
	СоздатьЧатыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора", ПараметрыФормы, Элементы.Сотрудники);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКлючОповещения(Команда)
	Если Не ЗначениеЗаполнено(КлючОповещенияДляРегистра) Тогда
		Сообщить("Заполните ключ оповещения.");
		Возврат;
	КонецЕсли;
	ЗаполнитьКлючОповещенияНаСервере();
КонецПроцедуры     

&НаКлиенте
Процедура ПолучитьЧаты(Команда)
	ПолучитьЧатыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПриветственноеСообщение(Команда)
	ОтправитьПриветственноеСообщениеНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура СотрудникиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для Каждого Сотрудник Из ВыбранноеЗначение Цикл
			ДобавитьСотрудникаИзПодбора(Сотрудник);
		КонецЦикла;
	Иначе
		ДобавитьСотрудникаИзПодбора(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСотрудникаИзПодбора(Сотрудник)
	Если Не ЗначениеЗаполнено(Сотрудник) Или СотрудникУжеЕстьВТаблицеНаКлиенте(Сотрудник) Тогда
		Возврат;
	КонецЕсли;
	НоваяСтрока = Сотрудники.Добавить();
	НоваяСтрока.Сотрудник = Сотрудник;
КонецПроцедуры

&НаКлиенте
Функция СотрудникУжеЕстьВТаблицеНаКлиенте(Сотрудник)
	Для Каждого СтрокаСотрудника Из Сотрудники Цикл
		Если СтрокаСотрудника.Сотрудник = Сотрудник Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

&НаСервере
Процедура ЗаполнитьСотрудниковНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТекущиеКадровыеДанныеСотрудников.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
		|ГДЕ
		|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И ТекущиеКадровыеДанныеСотрудников.ДатаПриема <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И (&ИспользоватьОрганизацию = ЛОЖЬ
		|		ИЛИ ТекущиеКадровыеДанныеСотрудников.ГоловнаяОрганизация = &Организация)
		|	И (&ИспользоватьПодразделение = ЛОЖЬ
		|		ИЛИ ТекущиеКадровыеДанныеСотрудников.ТекущееПодразделение = &Подразделение)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник";
	Запрос.УстановитьПараметр("ИспользоватьОрганизацию", ЗначениеЗаполнено(Организация));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ИспользоватьПодразделение", ЗначениеЗаполнено(Подразделение));
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если СотрудникУжеЕстьВТаблице(Выборка.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Сотрудники.Добавить();
		НоваяСтрока.Сотрудник = Выборка.Сотрудник;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПолучитьEmailНаСервере()
	СписокСотрудников = СписокСотрудниковДляЗапроса();
	Если СписокСотрудников.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ТаблицаEmail = ТаблицаEmailСотрудников(СписокСотрудников);
	Для Каждого СтрокаСотрудника Из Сотрудники Цикл
		Если Не ЗначениеЗаполнено(СтрокаСотрудника.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;
		НайденнаяСтрока = ТаблицаEmail.Найти(СтрокаСотрудника.Сотрудник, "Сотрудник");
		Если НайденнаяСтрока = Неопределено Или Не ЗначениеЗаполнено(НайденнаяСтрока.Email) Тогда
			СтрокаСотрудника.Email = EmailНеНайден();
		Иначе
			СтрокаСотрудника.Email = НайденнаяСтрока.Email;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьHuidНаСервере()    
	Если Не ЗначениеЗаполнено(ЧатШаблон) Тогда
		ВызватьИсключение "Не выбран чат-шаблон.";
	КонецЕсли;
	ЧатШаблонОбъект = ЧатШаблон.ПолучитьОбъект();
	ПодключениеExpress = ПодключениеExpressПоШаблону(ЧатШаблонОбъект);
	Для Каждого СтрокаСотрудника Из Сотрудники Цикл
		Если Не EmailЗаполненДляОбработки(СтрокаСотрудника.Email) Тогда
			СтрокаСотрудника.Huid = HuidНеПолучен();
			Продолжить;
		КонецЕсли;
		Попытка
			СтрокаСотрудника.Huid = RSN_eXpress.ИдентификаторПользователяПоЭлектроннойПочте(
				ПодключениеExpress.Соединение, ПодключениеExpress.Токен, СтрокаСотрудника.Email);
			Если ПустаяСтрока(СтрокаСотрудника.Huid) Тогда
				СтрокаСотрудника.Huid = HuidНеПолучен();
			КонецЕсли;
		Исключение
			СтрокаСотрудника.Huid = HuidНеПолучен(); 
			Сообщить(СтрШаблон(
				"Не удалось получить HUID для сотрудника %1: %2", СтрокаСотрудника.Сотрудник, ОписаниеОшибки()));
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СоздатьЧатыНаСервере() 
	Если Не ЗначениеЗаполнено(ЧатШаблон) Тогда
		ВызватьИсключение "Не выбран чат-шаблон.";
	КонецЕсли;
	ЧатШаблонОбъект = ЧатШаблон.ПолучитьОбъект();
	ПодключениеExpress = ПодключениеExpressПоШаблону(ЧатШаблонОбъект);
	Для Каждого СтрокаСотрудника Из Сотрудники Цикл 
		СтрокаСотрудника.Чат = ЧатСотрудника(ЧатШаблонОбъект, СтрокаСотрудника.Email, СтрокаСотрудника.Huid); 
		Если Не EmailЗаполненДляОбработки(СтрокаСотрудника.Email)
			Или Не HuidЗаполненДляОбработки(СтрокаСотрудника.Huid) Тогда
			СтрокаСотрудника.Статус = "Не Успешно";
			Продолжить;
		КонецЕсли;
		Попытка
			ЧатСотрудника = ?(ЗначениеЗаполнено(СтрокаСотрудника.Чат), СтрокаСотрудника.Чат.ПолучитьОбъект(), Справочники.Чаты.СоздатьЭлемент());	
			СоздатьОбновитьЧатДляСотрудника(ЧатСотрудника, ЧатШаблонОбъект, ПодключениеExpress, СтрокаСотрудника); 
			СтрокаСотрудника.Статус = "Успешно"; 
			СтрокаСотрудника.Чат = ЧатСотрудника.Ссылка
		Исключение
			СтрокаСотрудника.Статус = "Не Успешно"; 
			Сообщить(СтрШаблон(
				"Не удалось создать чат для сотрудника %1: %2", СтрокаСотрудника.Сотрудник, ОписаниеОшибки()));
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция СотрудникУжеЕстьВТаблице(Сотрудник)
	Для Каждого СтрокаСотрудника Из Сотрудники Цикл
		Если СтрокаСотрудника.Сотрудник = Сотрудник Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

&НаСервере
Функция СписокСотрудниковДляЗапроса()
	СписокСотрудников = Новый Массив;
	Для Каждого СтрокаСотрудника Из Сотрудники Цикл
		Если Не ЗначениеЗаполнено(СтрокаСотрудника.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;
		Если СписокСотрудников.Найти(СтрокаСотрудника.Сотрудник) = Неопределено Тогда
			СписокСотрудников.Добавить(СтрокаСотрудника.Сотрудник);
		КонецЕсли;
	КонецЦикла;
	Возврат СписокСотрудников;
КонецФункции

&НаСервере
Функция ТаблицаEmailСотрудников(СписокСотрудников)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ZUPC_НовыеCотрудники.Сотрудник КАК Сотрудник,
		|	ZUPC_НовыеCотрудники.ЭлектроннаяПочта КАК Email
		|ИЗ
		|	РегистрСведений.ZUPC_НовыеCотрудники КАК ZUPC_НовыеCотрудники
		|ГДЕ
		|	ZUPC_НовыеCотрудники.Сотрудник В(&Сотрудники)";
	Запрос.УстановитьПараметр("Сотрудники", СписокСотрудников);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаСервере
Функция ПодключениеExpressПоШаблону(ЧатШаблонОбъект)
	Если Не ЗначениеЗаполнено(ЧатШаблонОбъект.Бот) Тогда
		ВызватьИсключение "В чате-шаблоне не заполнен бот.";
	КонецЕсли;
	ДанныеБота = RSN_eXpress.ДанныеБота(ЧатШаблонОбъект.Бот.BotID);
	Если Не ЗначениеЗаполнено(ДанныеБота.BaseURL)
		Или Не ЗначениеЗаполнено(ДанныеБота.BotID)
		Или Не ЗначениеЗаполнено(ДанныеБота.Signature) Тогда
		ВызватьИсключение "Не заполнены настройки бота eXpress.";
	КонецЕсли;
	Соединение = Новый HTTPСоединение(
		ДанныеБота.BaseURL, , , , , ДанныеБота.Timeout, Новый ЗащищенноеСоединениеOpenSSL());
	Токен = RSN_eXpress.ТокенБота(Соединение, ДанныеБота);
	Возврат Новый Структура("Соединение, Токен, ДанныеБота", Соединение, Токен, ДанныеБота);
КонецФункции

&НаСервере
Функция ЧатСотрудника(ЧатШаблонОбъект, Email, Huid)
	Если Не EmailЗаполненДляОбработки(Email) И Не HuidЗаполненДляОбработки(Huid) Тогда
		Возврат Ложь;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Чаты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Чаты КАК Чаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чаты.Участники КАК ЧатыУчастников
		|		ПО ЧатыУчастников.Ссылка = Чаты.Ссылка
		|ГДЕ
		|	НЕ Чаты.ПометкаУдаления
		|	И Чаты.Бот = &Бот
		|	И Чаты.ТипЧата = &ТипЧата
		|	И ЧатыУчастников.Huid = &Huid
		|	И ЧатыУчастников.Email = &Email";
	Запрос.УстановитьПараметр("Бот", ЧатШаблонОбъект.Бот);
	Запрос.УстановитьПараметр("ТипЧата", ЧатШаблонОбъект.ТипЧата);
	Запрос.УстановитьПараметр("Huid", ?(HuidЗаполненДляОбработки(Huid), Huid, ""));
	Запрос.УстановитьПараметр("Email", ?(EmailЗаполненДляОбработки(Email), Email, ""));   
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;	
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

&НаСервере
Процедура СоздатьОбновитьЧатДляСотрудника(НовыйЧат, ЧатШаблонОбъект, ПодключениеExpress, СтрокаСотрудника)
	НовыйЧат.Бот = ЧатШаблонОбъект.Бот;
	НовыйЧат.Родитель = ЧатШаблонОбъект.Родитель;
	НовыйЧат.Наименование = ?(ДобавлятьВНаименованиеЧатаФамилиюСотрудника, СтрШаблон("%1: %2",ЧатШаблонОбъект.Наименование, СтрокаСотрудника.Сотрудник),
	ЧатШаблонОбъект.Наименование);
	НовыйЧат.ОписаниеЧата = ЧатШаблонОбъект.ОписаниеЧата;
	НовыйЧат.ПриветственноеСообщение = ЧатШаблонОбъект.ПриветственноеСообщение;
	НовыйЧат.СообщениеОбОбновленииФункционала = ЧатШаблонОбъект.СообщениеОбОбновленииФункционала;
	НовыйЧат.ТипЧата = ЧатШаблонОбъект.ТипЧата;
	НовыйЧат.Участники.Очистить();  
	НовыйУчастник = НовыйЧат.Участники.Добавить();
	НовыйУчастник.Email = СтрокаСотрудника.Email;
	НовыйУчастник.Huid = СтрокаСотрудника.Huid;  
	НовыйЧат.Команды.Очистить();
	Для Каждого Команда Из ЧатШаблонОбъект.Команды Цикл
		НоваяКоманда = НовыйЧат.Команды.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяКоманда, Команда);
	КонецЦикла;
	УчастникиExpress = Новый Массив;
	УчастникиExpress.Добавить(СтрокаСотрудника.Huid);
	ДанныеЧата = Новый Структура(
		"ИмяЧата, ОписаниеЧата, ТипЧата", НовыйЧат.Наименование, НовыйЧат.ОписаниеЧата, НовыйЧат.ТипЧата);
	НовыйЧат.IdЧата = RSN_eXpress.СоздатьЧат(
		ПодключениеExpress.Соединение, ДанныеЧата, ПодключениеExpress.Токен, УчастникиExpress);
	НовыйЧат.Записать();
КонецПроцедуры    

&НаСервере
Процедура СоздатьКлючОповещенияДляЧата(НовыйЧат)
	МЗ = РегистрыСведений.RSN_НастройкиОповещенийExpress.СоздатьМенеджерЗаписи();
	МЗ.КлючОповещения = КлючОповещенияДляРегистра;
	МЗ.Бот = НовыйЧат.Бот;
	МЗ.Чат = НовыйЧат.Ссылка;
	МЗ.Записать();
КонецПроцедуры


&НаСервере
Функция EmailЗаполненДляОбработки(Email)
	СтрокаEmail = СокрЛП(Строка(Email));
	Возврат Не ПустаяСтрока(СтрокаEmail) И ВРег(СтрокаEmail) <> ВРег(EmailНеНайден());
КонецФункции

&НаСервере
Функция HuidЗаполненДляОбработки(Huid)
	СтрокаHuid = СокрЛП(Строка(Huid));
	Возврат Не ПустаяСтрока(СтрокаHuid) И ВРег(СтрокаHuid) <> ВРег(HuidНеПолучен());
КонецФункции

&НаСервере
Функция EmailНеНайден()
	Возврат "email не найден";
КонецФункции

&НаСервере
Функция HuidНеПолучен()
	Возврат "HUID не получен";
КонецФункции

&НаСервере
Процедура ЗаполнитьКлючОповещенияНаСервере()
	Для Каждого СтрокаСотрудника Из Сотрудники Цикл
		Попытка
			СоздатьКлючОповещенияДляЧата(СтрокаСотрудника.Чат.ПолучитьОбъект());   
			СтрокаСотрудника.Статус = "Успешно"; 
		Исключение   
			СтрокаСотрудника.Статус = "Не Успешно"; 
			Сообщить(СтрШаблон(
			"Не удалось заполнить ключ оповещения для сотрудника %1: %2", СтрокаСотрудника.Сотрудник, ОписаниеОшибки()));
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПолучитьЧатыНаСервере()
	Если Не ЗначениеЗаполнено(ЧатШаблон) Тогда
		ВызватьИсключение "Не выбран чат-шаблон.";
	КонецЕсли;
	ЧатШаблонОбъект = ЧатШаблон.ПолучитьОбъект();
	Для Каждого СтрокаСотрудника Из Сотрудники Цикл 
		СтрокаСотрудника.Чат = ЧатСотрудника(ЧатШаблонОбъект, СтрокаСотрудника.Email, СтрокаСотрудника.Huid); 
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОтправитьПриветственноеСообщениеНаСервере()
	Для Каждого СтрокаСотрудника Из Сотрудники Цикл 
		Если ЗначениеЗаполнено(СтрокаСотрудника.Чат) Тогда  
			Справочники.Чаты.ОтправитьПриветственноеСообщение(СтрокаСотрудника.Чат.ПолучитьОбъект());
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
